print 'пиши, ёптель: '
x = gets.strip.to_s
puts x
x = x.each_char.map(&:to_s)
gets
i = {
	'А'=>'丹','Б'=>'石','В'=>'乃','Г'=>'厂','Д'=>'亼','Е'=>'仨','Ё'=>'仨','Ж'=>'水','З'=>'弓','И'=>'仈','Й'=>'订',
	'К'=>'长','Л'=>'人','М'=>'从','Н'=>'卄','О'=>'口','П'=>'刀','Р'=>'尸','С'=>'匚','Т'=>'丅','У'=>'丫','Ф'=>'中',
	'Х'=>'乂','Ц'=>'凵','Ч'=>'丩','Ш'=>'山','Щ'=>'山','Ъ'=>'乙','Ы'=>'辷','Ь'=>'乙','Э'=>'彐','Ю'=>'扣','Я'=>'牙'
}
arr = []
x.each do |name|
	if i[name.upcase]
		arr << i[name.upcase]
	else
		arr << name
	end
end
xr = ''
arr.each do |name|
	xr = xr + name
end
puts xr